# Importing Libraries

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
sns.set()

## Importing Train Data

In [4]:
data_train = pd.read_csv('train.csv')

### Data Manipulation

In [5]:
data_train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [6]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data_train = data_train.set_index('PassengerId')
data_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
data_train.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
columns = ['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked','Survived']
data_train = data_train[columns]
data_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

### Dropping Unnecessary Coiumns

In [10]:
data_train = data_train.drop('Name',axis=1)
data_train

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,
1,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
2,1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,female,35.0,1,0,113803,53.1000,C123,S,1
5,3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...
887,2,male,27.0,0,0,211536,13.0000,NaN,S,0
888,1,female,19.0,0,0,112053,30.0000,B42,S,1
889,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
890,1,male,26.0,0,0,111369,30.0000,C148,C,1
891,3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [11]:
data_train = data_train.drop('Ticket',axis=1)
data_train

,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,
1,3,male,22.0,1,0,7.2500,NaN,S,0
2,1,female,38.0,1,0,71.2833,C85,C,1
3,3,female,26.0,0,0,7.9250,NaN,S,1
4,1,female,35.0,1,0,53.1000,C123,S,1
5,3,male,35.0,0,0,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...
887,2,male,27.0,0,0,13.0000,NaN,S,0
888,1,female,19.0,0,0,30.0000,B42,S,1
889,3,female,NaN,1,2,23.4500,NaN,S,0
890,1,male,26.0,0,0,30.0000,C148,C,1
891,3,male,32.0,0,0,7.7500,NaN,Q,0

In [12]:
data_train = data_train.drop('Cabin',axis=1)
data_train

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
PassengerId
1                 3    male  22.0      1      0   7.2500        S         0
2                 1  female  38.0      1      0  71.2833        C         1
3                 3  female  26.0      0      0   7.9250        S         1
4                 1  female  35.0      1      0  53.1000        S         1
5                 3    male  35.0      0      0   8.0500        S         0
...             ...     ...   ...    ...    ...      ...      ...       ...
887               2    male  27.0      0      0  13.0000        S         0
888               1  female  19.0      0      0  30.0000        S         1
889               3  female   NaN      1      2  23.4500        S         0
890               1    male  26.0      0      0  30.0000        C         1
891               3    male  32.0      0      0   7.7500        Q         0

[891 rows x 8 columns]

In [13]:
data_train.describe(include='all')

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
count,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891.000000
unique,NaN,2,NaN,NaN,NaN,NaN,3,NaN
top,NaN,male,NaN,NaN,NaN,NaN,S,NaN
freq,NaN,577,NaN,NaN,NaN,NaN,644,NaN
mean,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,0.383838
std,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,0.486592
min,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,0.000000
25%,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,0.000000
50%,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,0.000000
75%,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,1.000000
max,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,1.000000

### Data Cleaning and Preprocessing

In [14]:
data_train.isnull().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
Survived      0
dtype: int64

In [15]:
data_train['Age'] = data_train['Age'].fillna(value=data_train['Age'].mean())
data_train.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
Survived    0
dtype: int64

In [16]:
data_train = data_train.dropna(axis=0)

In [17]:
data_train.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [18]:
data_train.describe(include='all')

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
count,889.000000,889,889.000000,889.000000,889.000000,889.000000,889,889.000000
unique,NaN,2,NaN,NaN,NaN,NaN,3,NaN
top,NaN,male,NaN,NaN,NaN,NaN,S,NaN
freq,NaN,577,NaN,NaN,NaN,NaN,644,NaN
mean,2.311586,NaN,29.653446,0.524184,0.382452,32.096681,NaN,0.382452
std,0.834700,NaN,12.968366,1.103705,0.806761,49.697504,NaN,0.486260
min,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,0.000000
25%,2.000000,NaN,22.000000,0.000000,0.000000,7.895800,NaN,0.000000
50%,3.000000,NaN,29.699118,0.000000,0.000000,14.454200,NaN,0.000000
75%,3.000000,NaN,35.000000,1.000000,0.000000,31.000000,NaN,1.000000
max,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,1.000000

In [19]:
data_train['Sex'].unique()

array(['male', 'female'], dtype=object)

In [20]:
#data_train['Sex'] = pd.get_dummies(data_train['Sex'],drop_first=True)
data_train['Sex'] = data_train['Sex'].replace(['male','female'],[1,0])

C:\Users\AMROEW~1\AppData\Local\Temp/ipykernel_23504/3722056828.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_train['Sex'] = data_train['Sex'].replace(['male','female'],[1,0])

In [21]:
data_train['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [22]:
#Embarked implies where the traveler mounted from.
#There are three possible values for Embark — Southampton, Cherbourg, and Queenstown. 
#More than 70% of the people boarded from Southampton. 
#Just under 20% boarded from Cherbourg and the rest boarded from Queenstown.
#People who boarded from Cherbourg had a higher chance of survival than people who boarded from Southampton or Queenstown.

In [23]:
data_train['Embarked'] = data_train['Embarked'].replace(['S','C','Q'],[0,1,2])

C:\Users\AMROEW~1\AppData\Local\Temp/ipykernel_23504/1659072102.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_train['Embarked'] = data_train['Embarked'].replace(['S','C','Q'],[0,1,2])

In [24]:
data_train['Pclass'].value_counts(1)

3    0.552306
1    0.240720
2    0.206974
Name: Pclass, dtype: float64

In [25]:
data_train['Family'] = data_train.Parch + data_train.SibSp
data_train

C:\Users\AMROEW~1\AppData\Local\Temp/ipykernel_23504/1817600750.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_train['Family'] = data_train.Parch + data_train.SibSp

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,Family
PassengerId,,,,,,,,,
1,3,1,22.000000,1,0,7.2500,0,0,1
2,1,0,38.000000,1,0,71.2833,1,1,1
3,3,0,26.000000,0,0,7.9250,0,1,0
4,1,0,35.000000,1,0,53.1000,0,1,1
5,3,1,35.000000,0,0,8.0500,0,0,0
...,...,...,...,...,...,...,...,...,...
887,2,1,27.000000,0,0,13.0000,0,0,0
888,1,0,19.000000,0,0,30.0000,0,1,0
889,3,0,29.699118,1,2,23.4500,0,0,3
890,1,1,26.000000,0,0,30.0000,1,1,0
891,3,1,32.000000,0,0,7.7500,2,0,0

In [26]:
data_train['Is_Alone'] = data_train.Family == 0
data_train

C:\Users\AMROEW~1\AppData\Local\Temp/ipykernel_23504/3816084575.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_train['Is_Alone'] = data_train.Family == 0

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,Family,Is_Alone
PassengerId,,,,,,,,,,
1,3,1,22.000000,1,0,7.2500,0,0,1,False
2,1,0,38.000000,1,0,71.2833,1,1,1,False
3,3,0,26.000000,0,0,7.9250,0,1,0,True
4,1,0,35.000000,1,0,53.1000,0,1,1,False
5,3,1,35.000000,0,0,8.0500,0,0,0,True
...,...,...,...,...,...,...,...,...,...,...
887,2,1,27.000000,0,0,13.0000,0,0,0,True
888,1,0,19.000000,0,0,30.0000,0,1,0,True
889,3,0,29.699118,1,2,23.4500,0,0,3,False
890,1,1,26.000000,0,0,30.0000,1,1,0,True
891,3,1,32.000000,0,0,7.7500,2,0,0,True

In [27]:
data_train['Is_Alone'] = data_train['Is_Alone'].astype(int)
data_train

C:\Users\AMROEW~1\AppData\Local\Temp/ipykernel_23504/4049781009.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_train['Is_Alone'] = data_train['Is_Alone'].astype(int)

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,Family,Is_Alone
PassengerId,,,,,,,,,,
1,3,1,22.000000,1,0,7.2500,0,0,1,0
2,1,0,38.000000,1,0,71.2833,1,1,1,0
3,3,0,26.000000,0,0,7.9250,0,1,0,1
4,1,0,35.000000,1,0,53.1000,0,1,1,0
5,3,1,35.000000,0,0,8.0500,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
887,2,1,27.000000,0,0,13.0000,0,0,0,1
888,1,0,19.000000,0,0,30.0000,0,1,0,1
889,3,0,29.699118,1,2,23.4500,0,0,3,0
890,1,1,26.000000,0,0,30.0000,1,1,0,1
891,3,1,32.000000,0,0,7.7500,2,0,0,1

In [28]:
data_train = data_train.drop('SibSp',axis=1)
data_train = data_train.drop('Parch',axis=1)

data_train

,Pclass,Sex,Age,Fare,Embarked,Survived,Family,Is_Alone
PassengerId,,,,,,,,
1,3,1,22.000000,7.2500,0,0,1,0
2,1,0,38.000000,71.2833,1,1,1,0
3,3,0,26.000000,7.9250,0,1,0,1
4,1,0,35.000000,53.1000,0,1,1,0
5,3,1,35.000000,8.0500,0,0,0,1
...,...,...,...,...,...,...,...,...
887,2,1,27.000000,13.0000,0,0,0,1
888,1,0,19.000000,30.0000,0,1,0,1
889,3,0,29.699118,23.4500,0,0,3,0
890,1,1,26.000000,30.0000,1,1,0,1
891,3,1,32.000000,7.7500,2,0,0,1

In [29]:
data_train = data_train.drop('Family',axis=1)
data_train

             Pclass  Sex        Age     Fare  Embarked  Survived  Is_Alone
PassengerId
1                 3    1  22.000000   7.2500         0         0         0
2                 1    0  38.000000  71.2833         1         1         0
3                 3    0  26.000000   7.9250         0         1         1
4                 1    0  35.000000  53.1000         0         1         0
5                 3    1  35.000000   8.0500         0         0         1
...             ...  ...        ...      ...       ...       ...       ...
887               2    1  27.000000  13.0000         0         0         1
888               1    0  19.000000  30.0000         0         1         1
889               3    0  29.699118  23.4500         0         0         0
890               1    1  26.000000  30.0000         1         1         1
891               3    1  32.000000   7.7500         2         0         1

[889 rows x 7 columns]

In [30]:
data_train.columns

Index(['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Survived', 'Is_Alone'], dtype='object')

In [31]:
columns_updated = ['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Is_Alone','Survived']
data_train = data_train[columns_updated]
data_train

             Pclass  Sex        Age     Fare  Embarked  Is_Alone  Survived
PassengerId
1                 3    1  22.000000   7.2500         0         0         0
2                 1    0  38.000000  71.2833         1         0         1
3                 3    0  26.000000   7.9250         0         1         1
4                 1    0  35.000000  53.1000         0         0         1
5                 3    1  35.000000   8.0500         0         1         0
...             ...  ...        ...      ...       ...       ...       ...
887               2    1  27.000000  13.0000         0         1         0
888               1    0  19.000000  30.0000         0         1         1
889               3    0  29.699118  23.4500         0         0         0
890               1    1  26.000000  30.0000         1         1         1
891               3    1  32.000000   7.7500         2         1         0

[889 rows x 7 columns]

In [32]:
data_train.head()

             Pclass  Sex   Age     Fare  Embarked  Is_Alone  Survived
PassengerId
1                 3    1  22.0   7.2500         0         0         0
2                 1    0  38.0  71.2833         1         0         1
3                 3    0  26.0   7.9250         0         1         1
4                 1    0  35.0  53.1000         0         0         1
5                 3    1  35.0   8.0500         0         1         0

In [81]:
np.savez('raw_data')

### Importing Test Data

In [33]:
data_test = pd.read_csv('test.csv')
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Data Manipulation

In [34]:
data_test.describe(include='all')

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,418.000000,418.000000,418,418,332.000000,418.000000,418.000000,418,417.000000,91,418
unique,NaN,NaN,418,2,NaN,NaN,NaN,363,NaN,76,3
top,NaN,NaN,"Kelly, Mr. James",male,NaN,NaN,NaN,PC 17608,NaN,B57 B59 B63 B66,S
freq,NaN,NaN,1,266,NaN,NaN,NaN,5,NaN,3,270
mean,1100.500000,2.265550,NaN,NaN,30.272590,0.447368,0.392344,NaN,35.627188,NaN,NaN
std,120.810458,0.841838,NaN,NaN,14.181209,0.896760,0.981429,NaN,55.907576,NaN,NaN
min,892.000000,1.000000,NaN,NaN,0.170000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,996.250000,1.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN
50%,1100.500000,3.000000,NaN,NaN,27.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,1204.750000,3.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.500000,NaN,NaN
max,1309.000000,3.000000,NaN,NaN,76.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN

In [35]:
data_test = data_test.drop('Cabin',axis=1)

In [36]:
data_test = data_test.set_index('PassengerId')

In [37]:
data_test.isnull().sum()

Pclass       0
Name         0
Sex          0
Age         86
SibSp        0
Parch        0
Ticket       0
Fare         1
Embarked     0
dtype: int64

In [38]:
data_test['Age'] = data_test['Age'].fillna(data_test['Age'].mean())

In [39]:
data_test['Fare'] = data_test['Fare'].fillna(data_test['Fare'].mean())

In [40]:
data_test.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [41]:
data_test['Embarked'] = data_test['Embarked'].replace(['S','C','Q'],[0,1,2])

In [42]:
data_test = data_test.drop('Name',axis=1)
data_test = data_test.drop('Ticket',axis=1)

In [43]:
data_test['Family'] = data_test.SibSp + data_test.Parch

In [44]:
data_test['Is_Alone'] = data_test['Family'] == 0

In [45]:
data_test['Is_Alone'] = data_test['Is_Alone'].astype(int)

In [46]:
data_test = data_test.drop('SibSp',axis=1)
data_test = data_test.drop('Parch',axis=1)

In [47]:
data_test = data_test.drop('Family',axis=1)

In [48]:
data_test['Sex'] = data_test['Sex'].replace(['male','female'],[1,0])

In [49]:
data_test = data_test[['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Is_Alone']]

### CheckPoints

In [50]:
data_train_copy = data_train.copy()
data_test_copy = data_test.copy()

In [51]:
columns_updated

['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Is_Alone', 'Survived']

In [52]:
features_train = data_train_copy.drop('Survived',axis=1)
target_train = data_train_copy['Survived']

## Split the Data

In [53]:
from sklearn.model_selection import train_test_split

ft_train, ft_test, ta_train, ta_test = train_test_split(features_train, target_train,train_size=0.8)

### DecisionTree Model

In [54]:
from sklearn.tree import DecisionTreeClassifier

In [55]:
clf = DecisionTreeClassifier()
clf.fit(ft_train,ta_train)

DecisionTreeClassifier()

In [56]:
predictions = clf.predict(ft_test)

In [57]:
from sklearn.metrics import accuracy_score
accuracy_score(predictions,ta_test)

0.7528089887640449

### Predictions For Testing Data

In [58]:
predictions_test = clf.predict(data_test)

In [59]:
predictions_test

array([0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [60]:
submisson3 = pd.DataFrame({'PassengerId':data_test.index,'Survived':predictions_test})

In [61]:
submisson3.to_csv('submission3.csv',index=False)

## Logistics Regression Model

In [62]:
from sklearn.linear_model import LogisticRegression
logit = LogisticRegression()
classifier = logit.fit(ft_train,ta_train)

In [63]:
ta_pred_log = classifier.predict(ft_test)

In [64]:
from sklearn.metrics import confusion_matrix

In [65]:
confusion_matrix(ta_test,ta_pred_log)

array([[94, 23],
       [19, 42]], dtype=int64)

In [66]:
accuarcy = (90+52)/(90+52+13+23)
accuarcy

0.797752808988764

###  Predictions For Testing Data

In [67]:
ta_pred_log_test = classifier.predict(data_test)

In [68]:
ta_pred_log_test

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [69]:
submisson4 = pd.DataFrame({'PassengerId':data_test.index,'Survived':ta_pred_log_test})

In [70]:
submisson4.to_csv('submission4.csv',index=False)

## Random Forest Model

In [71]:
from sklearn.ensemble import RandomForestClassifier

In [72]:
clf_random = RandomForestClassifier()

In [73]:
clf_random.fit(ft_train, ta_train)

RandomForestClassifier()

In [74]:
random_predict = clf_random.predict(ft_test)

In [75]:
from sklearn.metrics import classification_report

In [76]:
print(classification_report(ta_test,random_predict))

              precision    recall  f1-score   support

           0       0.86      0.82      0.84       117
           1       0.69      0.75      0.72        61

    accuracy                           0.80       178
   macro avg       0.78      0.79      0.78       178
weighted avg       0.80      0.80      0.80       178

### Predictions For Testing Data

In [77]:
random_predict_test = clf_random.predict(data_test)

In [78]:
random_predict_test

array([0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [79]:
submisson5 = pd.DataFrame({'PassengerId':data_test.index,'Survived':random_predict_test})
submisson5.to_csv('submission5.csv',index=False)

In [80]:
submisson5.to_csv('submission5.csv',index=False)